app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = 3  [["email", "bob2@bob.com"], ["password_digest", "$2a$10$sN89WIZ/B1jlwl4AW.j/0.iaAQJ7zUohmgJI4JBW9pOWsIjWfYJxe"], ["updated_at", "2014-09-16 14:19:31.946533"]]
---
  def update
    respond_to do |format|
      if current_user.update(user_params)